SoftSled/KeyExchange/1/KeyExchange7.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<m:Commit xmlns:m="urn:schemas-microsoft-com:service:mstrustagreement:1">
			<HostID xmlns:dt="urn:schemas-microsoft-com:datatypes" dt:dt="string">uuid:e73681eb-1c62-4083-bd99-a1c408d30457</HostID>
			<Iteration xmlns:dt="urn:schemas-microsoft-com:datatypes" dt:dt="ui1">2</Iteration>
			<HostValidateAuthenticator xmlns:dt="urn:schemas-microsoft-com:datatypes" dt:dt="string">AEUPa8nJPSrZ5iRNKzst3ADOdzo=</HostValidateAuthenticator>
		</m:Commit>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
